-- ----------------------------------------------------------------------------------------
-- Gabriel Issa Shammas (GIS) - 01 de janeiro de 2000 a 31 de dezembro de 2014
-- ----------------------------------------------------------------------------------------
-- Doc- QUERY040- dbo.GIS_TB03S001_PAISES
--
-- Qual é o total de países existentes?
-- Atenção: Observar com atenção como é o nome da coluna.
--

USE BD_T_G01;

Select count(*)
  From dbo.FCS_TB03S001_PAISES;

-- ----------------------------------------------------------------------------------------
-- Fim das Queries
-- ----------------------------------------------------------------------------------------
